// ASCII2Unicode Kannada Text Encoding converter
// Copyright (C) 2011, 2012 Aravinda VK <hallimanearavind@gmail.com>
//                                      <http://aravindavk.in>

// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.

// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.

// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.

var mapping = {
"!":"!"
""":"""
"#":"#"
"$":"৳"
"%":"%"
"&":"্"
"":"র্"
"(":"("
")":")"
"*":"*"
"+":"+"
",":","
"-":"-"
".":"."
"/":"/"
"0":"০"
"1":"১"
"2":"২"
"3":"৩"
"4":"৪"
"5":"৫"
"6":"৬"
"7":"৭"
"8":"৮"
"9":"৯"
":":":"
";":";"
"< ":"< "
"'=":"'="
"> ":"> "
"?":"?"
"@":"@"
"A":"অ"
"B":"ই"
"C":"ঈ"
"D":"উ"
"E":"ঊ"
"F":"ঋ"
"G":"ে"
"H":"ঐ"
"I":"ও"
"J":"ঔ"
"K":"ক"
"L":"খ"
"M":"গ"
"N":"ঘ"
"O":"ঙ"
"P":"চ"
"Q":"ছ"
"R":"জ"
"S":"ঝ"
"T":"ঞ"
"U":"ট"
"V":"ঠ"
"W":"ড"
"X":"ঢ"
"Y":"ণ"
"Z":"ত"
"[":"["
"\":"৷৷"
"]":"]"
"^":"থ"
"_":"-"
"`":"দ"
"a":"ধ"
"b":"ন"
"c":"প"
"d":"ফ"
"e":"ব"
"f":"ভ"
"g":"ম"
"h":"য"
"i":"র"
"j":"ল"
"k":"শ"
"l":"ষ"
"m":"স"
"n":"হ"
"o":"ড়"
"p":"ঢ়"
"q":"য়"
"r":"ৎ"
"s":"ং"
"t":"ঃ"
"u":"ঁ"
"v":"া"
"w":"ি"
"x":"ী"
"y":"ু"
"z":"ূ"
"{":"{"
"|":"।"
"}":"}"
"~":"ু"
"":""
"¡":"ট"
"¢":"ঢ"
"£":"ড"
"¤":"ঠ"
"¥":"ণ্"
"¦":"ত"
"§":"ত্ত"
"¨":"ত্তর"
"©":"থ"
"ª":"দ্"
"«":"দ্"
"¬":"ব্ধ"
"­":"-"
"®":"ন্"
"¯":"ম্"
"°":"ণ্"
"±":"হ্‌"
"²":"ন্"
"³":"ন"
"´":"ন্"
"µ":"প্"
"¶":"প্"
"·":"প্"
"¸":"প্"
"¹":"ফ"
"º":"ব্‌"
"»":"ব"
"¼":"ব"
"½":"ব"
"¾":"ব"
"¿":"ভ"
"À":"ভ্র"
"Á":"ম্"
"Â":"ম"
"Ã":"ম"
"Ä":"ম"
"Å":"্য"
"Æ":"র্"
"Ç":"্র"
"È":"্র"
"É":"্র"
"Ê":"্র"
"Ë":"্র"
"Ì":"্র"
"Í":"ল্"
"Î":"ল্"
"Ï":"ল্"
"Ð":"ল্"
"Ñ":"ল্"
"Ò":"ষ্"
"Ó":"ষ্"
"Ô":"স্"
"Õ":"স্"
"Ö":"স্"
"×":"্হ"
"Ø":"ক্ক"
"Ù":"ক্ট"
"Ú":"ক্ত"
"Û":"ক্ব"
"Ü":"ক্ম"
"Ý":"ক্স"
"Þ":"ক্ষ"
"ß":"ক্ষ্ম"
"à":"গু"
"á":"গ্‌দ"
"â":"ঙ্ক"
"ã":"ঙ্গ"
"ä":"জ্জ"
"å":"জ্ঝ"
"æ":"জ্ঞ"
"ç":"ঞ্চ"
"è":"ঞ্ছ"
"é":"ঞ্জ"
"ê":"ঞ্ঝ"
"ë":"ট্ট"
"ì":"ড্ড"
"í":"ণ্ড"
"î":"ত্ত"
"ï":"ত্থ"
"ð":"ত্ন"
"ñ":"ত্ম"
"ò":"ত্র"
"ó":"দ্দ"
"ô":"ব্জ"
"õ":"ব্দ"
"ö":"ভ্র"
"÷":"শু"
"ø":"শ্চ"
"ù":"শ্ছ"
"ú":"ষ্ণ"
"û":"স্খ"
"ü":"হু"
"ý":""
"þ":"হ্ম"
"ÿ":"ড়্গ"
"Ĥ":"-"
"ĥ":"ম্‌"
"Œ":"ৗ"
"œ":"চ্‌"
"Š":"ৈ"
"š":"গ্‌"
"Ÿ":"ট্‌"
"ƒ":"ূ"
"ˆ":"ে"
"ˉ":"ন্‌"
"˜":"ক্র"
"μ":"প্‌"
"–":"x"
"—":"÷"
"‘":"‘"
"’":"‘"
"‚":"ত্‌"
"“":"“"
"”":"”"
"„":"ূ"
"†":"ৃ"
"‡":"ৃ"
"•":"ক্"
"…":"ূ"
"‰":"এ"
"‹":"ৈ"
"›":"ঙ্‌"
"™":"গ্‌"
"™":"-"
"∙":"প"
};

// These when joined will be broken as per unicode 
var broken_cases = {
    "Ã":{
        "value": "ೀ",
        "mapping": {
            "ಿ": "ೀ",
            "ೆ": "ೇ",
            "ೊ": "ೋ"
            }
        }, 
    "Ä":{
        "value": "ು",
        "mapping": {
            
            }
        }, 
    "Æ":{
        "value": "ೂ",
        "mapping": {
            "ೆ":"ೊ"
            }
        }, 
    "È":{
        "value": "ೃ",
        "mapping": {
            
            }
        }, 
    "Ê":{
        "value": "ೈ",
        "mapping": {
            "ೆ":"ೈ"
            }
        }  
    };

var dependent_vowels = ["್", "ಾ", "ಿ", "ೀ", "ು", "ೂ", "ೃ", "ೆ", "ೇ", "ೈ", "ೊ", "ೋ", "ೌ"];
var ignore_list = {"ö": "", "÷": ""};

var vattaksharagalu = {
    "Ì": "ಕ",
    "Í": "ಖ",
    "Î": "ಗ",
    "Ï": "ಘ",
    "Õ": "ಞ",
    "Ñ": "ಚ",
    "Ò": "ಛ",
    "Ó": "ಜ",
    "Ô": "ಝ",
    "Ö": "ಟ",
    "×": "ಠ",
    "Ø": "ಡ",
    "Ù": "ಢ",
    "Ú": "ಣ",
    "Û": "ತ",
    "Ü": "ಥ",
    "Ý": "ದ",
    "Þ": "ಧ",
    "ß": "ನ",
    "à": "ಪ",
    "á": "ಫ",
    "â": "ಬ",
    "ã": "ಭ",
    "ä": "ಮ",
    "å": "ಯ",
    "æ": "ರ",
    "è": "ಲ",
    "é": "ವ",
    "ê": "ಶ",
    "ë": "ಷ",
    "ì": "ಸ",
    "í": "ಹ",
    "î": "ಳ",
    "ç": "ರ"
};

var ascii_arkavattu = {
    "ð": "ರ"
};
